#include "sys.h"

//////////////////////////////////////////////////////////////////////////////////	 

/******************************************************************/


//STM32F103ZE核心板
//系统中断分组设置化		 

//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

/******************************************************************/



//THUMB指令不支持汇编内联
//采用如下方法实现执行汇编指令WFI  

void WFI_SET(void)
{
	__ASM volatile("wfi");		  
}

/******************************************************************/

//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	
/******************************************************************/

//关闭所有中断
void INTX_DISABLE(void)
{		  
	__ASM volatile("cpsid i");
}

/******************************************************************/

//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	
/******************************************************************/

//开启所有中断
void INTX_ENABLE(void)
{
	__ASM volatile("cpsie i");		  
}


/******************************************************************/

//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	
/******************************************************************/


//设置栈顶地址
//addr:栈顶地址
__asm void MSR_MSP(u32 addr) 
{
    MSR MSP, r0 			//set Main Stack value
    BX r14
}




































/******************************************************************/

//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	
/******************************************************************/










